trunk/share/man/man8/rc.8
.\"	$OpenBSD: rc.8,v 1.25 2007/05/31 19:19:59 jmc Exp $
.\"
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rc.8	8.2 (Berkeley) 12/11/93
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt RC 8
.Os
.Sh NAME
.Nm rc
.Nd command scripts for system startup
.Sh SYNOPSIS
.Nm /etc/rc
.Nm /etc/rc.local
.Nm /etc/rc.securelevel
.Sh DESCRIPTION
.Nm rc
is the command script that is invoked by
.Xr init 8
during an automatic reboot and after single user mode is exited;
it performs system housekeeping chores and starts up system daemons.
Additionally,
.Nm rc
is intricately tied to the
.Xr netstart 8
script, which runs commands and daemons pertaining to the network.
The
.Nm rc.securelevel
and
.Nm rc.local
scripts hold commands which are pertinent only to a specific site.
.Pp
All four of these startup scripts are (or can be) controlled to some
extent by variables defined in
.Xr rc.conf 8
and
.Xr rc.conf.local 8 ,
which specify which daemons and services to run.
.Pp
When an automatic reboot is in progress,
.Nm rc
is invoked with the argument
.Em autoboot .
The first portion of
.Nm rc
runs an
.Xr fsck 8
with option
.Fl p
to
.Dq preen
all disks of minor inconsistencies resulting
from the last system shutdown and to check for serious inconsistencies
caused by hardware or software failure.
If this auto-check and repair succeeds, then the second part of
.Nm rc
is run.
.Pp
However, if the file
.Pa /fastboot
exists,
.Xr fsck 8
will not be invoked during this boot.
This file is then removed so that fsck will be run on subsequent boots.
.Pp
The second part of
.Nm rc ,
which is run after an auto-reboot succeeds and also if
.Nm rc
is invoked when a single user shell terminates (see
.Xr init 8 ) ,
then asks
.Xr rc.conf 8
for configuration variables,
mounts filesystems, starts system daemons,
preserves editor files,
clears the scratch directory
.Pa /tmp ,
and saves any possible core image that might have been
generated as a result of a system crash, with
.Xr savecore 8 .
.Pp
Before
.Nm rc
starts most system daemons,
.Xr netstart 8
is executed.
.Pp
.Nm rc.securelevel
is executed by
.Nm rc
to start daemons that must be run before the security level changes.
Following this,
.Nm rc
then sets the security level to the value specified in the
.Va securelevel
variable in that file.
See
.Xr securelevel 7
for the effects of setting the security level.
.Pp
.Nm rc.local
is executed towards the end of
.Nm rc
(it is not the very last as there are a few services that must be
started at the very end).
Normally,
.Nm rc.local
contains commands and daemons that are not part of the
stock installation.
.Sh CONFIGURATION EXAMPLES
The
.Xr rc.conf 8
file contains a series of Bourne-shell syntax assignments that
are used to configure kernel configurations, network configuration,
and various other system daemons.
As described above, this file is sourced (using
.Xr sh 1
of course) by
.Pa /etc/rc .
Various comments in
.Xr rc.conf 8
make it clear what each variable does.
Refer to the specific man pages for each daemon to determine what that
subsystem does.
.Pp
For example, the
.Xr machctld 8
daemon is controlled by the following line:
.Bd -literal -offset indent
machctld_flags=NO        # for normal use: ""
.Ed
.Pp
This does not start
.Xr machctld 8
at system startup.
To start
.Xr machctld 8 ,
the following entry can be used:
.Bd -literal -offset indent
machctld_flags=""
.Ed
.Pp
Alternately,
.Xr machctld 8
can be started with the
.Fl b
option (to listen on a specific address):
.Bd -literal -offset indent
machctld_flags="-b localhost"
.Ed
.Sh EXTERNAL INFLUENCES
Before
.Xr init 8
starts
.Nm rc ,
it sets the process priority, umask, and resource limits according to the
.Dq daemon
login class as described in
.Xr login.conf 5 .
.Sh FILES
.Bl -tag -width "/etc/rc.securelevelXX" -compact
.It /etc/rc
Command scripts for system startup.
.It /etc/rc.local
Site specific command scripts for system startup.
.It /etc/rc.conf
System daemon configuration database.
.It /etc/rc.conf.local
Site specific daemon configuration database.
.It /etc/rc.securelevel
Commands run before the security level changes.
.It /etc/rc.shutdown
Commands run at system shutdown.
.It /etc/login.conf
Login class capability database.
.It /etc/netstart
Command script for network startup.
.It Pa /fastboot
Tells
.Xr rc 8
not to run
.Xr fsck 8
during the next boot.
.El
.Sh SEE ALSO
.Xr login.conf 5 ,
.Xr sysctl.conf 5 ,
.Xr securelevel 7 ,
.Xr init 8 ,
.Xr netstart 8 ,
.Xr rc.conf 8 ,
.Xr rc.shutdown 8 ,
.Xr reboot 8 ,
.Xr savecore 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
