share/man/man4/lptgpio.4
.\"	$FabBSD$
.\"	$OpenBSD: lpt.4,v 1.7 2007/06/20 17:44:07 kettenis Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: June 20 2007 $
.Dt LPT 4
.Os
.Sh NAME
.Nm lptgpio
.Nd parallel port general purpose I/O driver
.Sh SYNOPSIS
.Cd "# alpha, amd64, i386"
.Cd "lptgpio0 at isa? port 0x378 irq 7"
.Cd "lptgpio1 at isa? port 0x278"
.Cd "lptgpio2 at isa? port 0x3bc"
.Cd "lptgpio3 at puc?"
.Cd "gpio* at lptgpio?"
.Pp
.Cd "# sparc64"
.Cd "lptgpio* at apio?"
.Cd "lptgpio* at ebus?"
.Cd "gpio* at lptgpio?"
.Sh DESCRIPTION
This driver provides
.Xr gpio 4
access to parallel ports.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr gpio 4
