share/man/man8/rc.conf.8
.\"	$OpenBSD: rc.conf.8,v 1.16 2008/05/07 12:05:35 claudio Exp $
.\"
.\" Copyright (c) 1997 Ian F. Darwin
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 7 2008 $
.Dt RC.CONF 8
.Os
.Sh NAME
.Nm rc.conf ,
.Nm rc.conf.local
.Nd system daemon configuration database
.Sh DESCRIPTION
This file contains a series of Bourne-shell syntax assignments
that are used to configure the system daemons.
It is not read by the kernel, but is sourced by various other files
in the
.Pa /etc/rc.*
series in order to set shell variables used therein
to control the behaviour of the scripts.
.Pp
It is advisable to leave the
.Pa /etc/rc.conf
file untouched, and instead create and edit a new
.Pa /etc/rc.conf.local
file.
Variables set in this file will override variables previously set in
.Pa /etc/rc.conf .
.Pp
There are three sections in this file.
The first is used to turn features on or off.
For example, whether the system runs the
.Xr machctld 8
daemon is determined by the line in this section
.Bd -literal -offset indent
machctld_flags=NO		# for normal use: ""
.Ed
.Pp
If this line is edited to contain some valid machctld daemon command-line
flags, such as
.Bd -literal -offset indent
machctld_flags="-b localhost"
.Ed
.Pp
then the machctl daemon will be started with those options.
.Pp
The second section contains some other programs that can either be run or not,
but that don't need options.
They can be set to YES or NO.
For example, the line
.Bd -literal -offset indent
nfs_server=NO
.Ed
.Pp
prevents the NFS server daemons from starting.
To run NFS, just change this line's value from NO to YES,
.Sy and
also make whatever changes are needed for the server
to have something to do (set up the
.Xr exports 5
file etc.).
.Pp
The third section contains values that parameterize servers started by
one of the first two sections, and are ignored if the corresponding
server is not running.
For example, if
.Nm nfs_server ,
is enabled, then the line
.Bd -literal -offset indent
nfsd_flags="-tun 4"
.Ed
.Pp
provides command-line arguments for the NFS server.
.Pp
This particular line instructs
.Xr nfsd 8
to start four copies of the server.
On a busy file server, 8 (or more) copies are recommended.
.Sh SEE ALSO
.Xr init 8 ,
.Xr intro 8 ,
.Xr rc 8
.Sh HISTORY
The
.Nm
file first appeared in
.Ox 2.2 .
